package msg

// ERROR 3000-3999
var (
	E3000 = "E3000 Ошибка: запрос в БД не выполнен."
	E3001 = "E3001 Ошибка: сканирования аргументов, проверьте правильность и последовательность аргументов."
	E3002 = "E3002 Ошибка: возникла во время итерации."
	E3003 = "E3003 Ошибка: соединение с БД не установлено."
)

// Общие
var (
	E3100 = "E3100 Ошибка чтении файла."
	E3101 = "E3101 Ошибка загрузки конфигурации."
	E3102 = "E3102 Ошибка файла не существует по указанному пути."
	E3103 = "E3103 Ошибка инициализации журнала."
)
