package msg

var (
	H7000 = "H7000 Ошибка: метод не разрешен."
	H7001 = "H7001 Ошибка: сервер не доступен."
	H7002 = "H7002 Ошибка: ошибка 405, метод не поддерживается."
	H7003 = "H7003 Ошибка: ошибка 500, сервер не отвечает."
	H7004 = "H7004 Ошибка: ошибка 400, неправильный, некорректный формат UUID."
	H7005 = "H7005 Ошибка: ошибка 404, объект не найден."
	H7006 = "H7006 Ошибка: ошибка парсинга шаблона html."
	H7007 = "H7007 Ошибка: ошибка записи данных в шаблон HTML."
	H7008 = "H7008 Ошибка: ошибка разбора формы."
	H7009 = "H7009 Ошибка: ошибка обновление объекта."
	H7010 = "H7010 Ошибка: ошибка объект не найден."
	H7011 = "H7011 Ошибка: ошибка при удалении объекта."
	H7012 = "H7012 Ошибка: ошибка при добавлении объекта."
	H7013 = "H7013 Ошибка: ошибка 400, неправильный, некорректный формат ID."
)
