package msg

// ERROR 3000-3999
var (
	E3000 = "E3000 Ошибка: запрос в БД не выполнен."
	E3001 = "E3001 Ошибка: сканирования аргументов, проверьте правильность и последовательность аргументов."
	E3002 = "E3002 Ошибка: возникла во время итерации."
	E3003 = "E3003 Ошибка: соединение с БД не установлено."
	E3004 = "E3004 Ошибка: данные не найдены."
	E3005 = "E3005 Ошибка: объект по ИД не найден."
	E3006 = "E3006 Ошибка: объект не удалось создать."
	E3007 = "E3007 Ошибка: объект не удалось обновить."
	E3008 = "E3008 Ошибка: объект не удалось удалить."
	E3009 = "E3009 Ошибка: ошибка при проверки объекта на существование."
)

// Общие
var (
	E3100 = "E3100 Ошибка чтении файла."
	E3101 = "E3101 Ошибка загрузки конфигурации."
	E3102 = "E3102 Ошибка файла не существует по указанному пути."
	E3103 = "E3103 Ошибка инициализации журнала."
	E3104 = "E3104 Ошибка запуска сервера."
	E3105 = "E3105 Ошибка записи в поток JSON."
	E3106 = "E3106 Ошибка завершения сервера."
)
